Абонементы/src/Documents/Абонемент/Абонемент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Абонемент</name>
  <registerRecords>AccumulationRegister.ДоступныеУслуги</registerRecords>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Абонементы/src/AccumulationRegisters/ДоступныеУслуги/ДоступныеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоступныеУслуги</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.Абонемент</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Абонементы/src/Documents/Абонемент/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДоступныеУслуги.Записывать = Истина;
	
	Запись = Движения.ДоступныеУслуги.ДобавитьПриход();
	Запись.Период = Дата;
	Запись.Абонемент = Ссылка;
	Запись.Количество = Количество;

КонецПроцедуры
